# Analysis

### Importando as bibliotecas

In [1]:
import sys
sys.path.append('..')
import pandas as pd
import params.consts as consts

### Lendo o dataset

In [2]:
df = pd.read_csv(consts.DATASET) # Armazenando o dataset em uma variável

In [3]:
display(df.head(3)) # Exibindo as 3 primeiras linhas do dataset

display(df.tail(3)) # Exibindo as 3 últimas linhas do dataset

,order_number,order_date,category,customer_id,name,gender,country,order_quantity,sales_amount,total_product_cost,sales_profit
0,SO51520,2013-01-18,Bikes,11015,Chloe Young,Female,United States,1,2319.99,1265.6195,1054.3705
1,SO52512,2013-02-09,Bikes,11016,Wyatt Hill,Male,United States,1,2294.99,1251.9813,1043.0087
2,SO51610,2013-01-23,Bikes,11021,Destiny Wilson,Female,United States,1,2294.99,1251.9813,1043.0087

,order_number,order_date,category,customer_id,name,gender,country,order_quantity,sales_amount,total_product_cost,sales_profit
3262,SO68872,2013-10-21,Bikes,29276,Sydney Flores,Female,United States,1,742.35,461.4448,280.9052
3263,SO68725,2013-10-19,Bikes,29278,Janet Scott,Female,United States,1,742.35,461.4448,280.9052
3264,SO68389,2013-10-14,Bikes,29279,Hailey Turner,Female,United States,1,742.35,461.4448,280.9052

### Visualizando os detalhes do dataset

In [4]:
df.info() # Exibindo as informações das variáveis do dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3265 entries, 0 to 3264
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_number        3265 non-null   object
 1   order_date          3265 non-null   object
 2   category            3265 non-null   object
 3   customer_id         3265 non-null   int64
 4   name                3265 non-null   object
 5   gender              3265 non-null   object
 6   country             3265 non-null   object
 7   order_quantity      3265 non-null   int64
 8   sales_amount        3265 non-null   float64
 9   total_product_cost  3265 non-null   float64
 10  sales_profit        3265 non-null   float64
dtypes: float64(3), int64(2), object(6)
memory usage: 280.7+ KB

### Visualizando as estatísticas das colunas numéricas

In [5]:
df.describe() # Usando a função que exibe as estatísticas das colunas numéricas

,customer_id,order_quantity,sales_amount,total_product_cost,sales_profit
count,3265.000000,3265.0,3265.000000,3265.00000,3265.000000
mean,19444.692802,1.0,1559.050092,918.23470,640.815392
std,4881.119555,0.0,765.283636,437.29179,340.795437
min,11015.000000,1.0,539.990000,294.57970,196.340400
25%,15367.000000,1.0,742.350000,419.77840,280.905200
50%,19131.000000,1.0,1700.990000,1082.51000,618.480000
75%,23453.000000,1.0,2319.990000,1265.61950,1043.008700
max,29279.000000,1.0,2443.350000,1554.94790,1054.370500

### Visualizando as estatísticas da colunas categóricas

In [6]:
df.describe(exclude='number') # Exibindo as estatísticas das colunas categóricas

       order_number  order_date category          name  gender        country
count          3265        3265     3265          3265    3265           3265
unique         3265         362        1          3244       2              1
top         SO51520  2013-11-06    Bikes  Kristi Perez  Female  United States
freq              1          23     3265             2    1678           3265

### Verificando as colunas com valores nulos

In [7]:
df.isnull().sum() # Somando todos os valores nulos de cada coluna

order_number          0
order_date            0
category              0
customer_id           0
name                  0
gender                0
country               0
order_quantity        0
sales_amount          0
total_product_cost    0
sales_profit          0
dtype: int64